import requests
from bs4 import BeautifulSoup
import re
from datetime import datetime


class ElectionScrapper:
    def __init__(self):
        self.dates_url = None

    def _update_dates_url(self):
        url_base = r'https://bechirot@.bechirot.gov.il/election/about/Pages/ElectionDates.aspx'
        i = 20
        while True:
            i += 1
            current_url = url_base.replace('@', str(i))
            try:
                request = requests.get(current_url)
                if request.status_code == 200:
                    self.dates_url = current_url
                else:
                    break
            except requests.exceptions.ConnectionError as e:
                break

    def month_heb_to_eng(self, month):
        d = dict()
        d['ינואר'] = 1
        d['פברואר'] = 2
        d['מרץ'] = 3
        d['מרס'] = 3
        d['אפריל'] = 4
        d['מאי'] = 5
        d['יוני'] = 6
        d['יולי'] = 7
        d['אוגוסט'] = 8
        d['ספטמבר'] = 9
        d['אוקטובר'] = 10
        d['נובמבר'] = 11
        d['דצמבר'] = 12
        return int(d[month])

    def scrape_dates(self):
        s = '''הבחירות לכנסת הראשונה
 
מועד הבחירות 25 בינואר 1949.
יושב ראש הוועדה – השופט מנחם דונקלבלום.
רשימת המועמדים לאספה המכוננת – עיתון רשמי חוברת 43 עמ' 316, מיום 19.1.49.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לאספה המכוננת – עיתון רשמי חוברת 49 עמ' 400, מיום 7.2.49.​קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת השנייה
 
מועד הבחירות – 20 באוגוסט 1951.
יושב ראש הוועדה – השופט יצחק אולשן.
רשימת המועמדים לכנסת השנייה – חוברת 174 עמ' 1141, מיום 13.7.51.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת השנייה – חוברת 181 עמ' 1241, מיום 10.8.51.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת השלישית
 
מועד הבחירות 26 ביוני 1955.
יושב ראש הוועדה – השופט שמעון אגרנט.
רשימת המועמדים לכנסת השלישית – חוברת 425 עמ' 1005, מיום 10.7.55.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת השלישית – חוברת 432 עמ' 1137, מיום 8.8.55.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת הרביעית
 
מועד הבחירות – 3 בנובמבר 1959.
יושב ראש הוועדה – השופט יואל זוסמן.
רשימת המועמדים לכנסת הרביעית – חוברת 704 עמ' 45, מיום 18.10.59.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת הרביעית – חוברת 717 עמ' 263, מיום 15.11.59.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת החמישית
 

מועד הבחירות – 5 באוגוסט 1961.
יושב ראש הוועדה – השופט צבי ברנזון.
רשימת המועמדים לכנסת החמישית – חוברת 863 עמ' 1795, מיום 30.7.61.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת החמישית – חוברת 869 עמ' 1937, מיום 24.8.61.​קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת השישית
 
מועד הבחירות – 2 בנובמבר 1965.
יושב ראש הוועדה – השופט משה לנדאו.
רשימת המועמדים לכנסת השישית – חוברת 1222 עמ' 133, מיום 17.10.65.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת השישית – חוברת 1230 עמ' 311, מיום 12.11.65.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת השביעית
 
מועד הבחירות – 28 באוקטובר 1969.
יושב ראש הוועדה – השופט אלפרד ויתקון.
רשימת המועמדים לכנסת השביעית – חוברת 1563 עמ' 207, מיום 20.10.69.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת השביעית– חוברת 1573 עמ' 433, מיום 7.11.69.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת השמינית
 
מועד הבחירות – 31 בדצמבר 1973 (מועד הבחירות הקבוע היה 30 באוקטובר 1973 – אך הבחירות נדחו בשל מלחמת יום הכיפורים).
יושב ראש הוועדה – השופט חיים כהן.
רשימת המועמדים לכנסת השמינית – חוברת 1954 עמ' 86, מיום 21.10.73.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת השמינית – חוברת 1979 עמ' 608, מיום 11.1.74.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת התשיעית
 
מועד הבחירות – 17 במאי 1977.
יושב ראש הוועדה – השופט אליהו מני.
רשימת המועמדים לכנסת התשיעית – חוברת 2319 עמ' 1320, מיום 9.5.77.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת התשיעית – חוברת 2326 עמ' 1494, מיום 29.5.77.​קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת העשירית
 
מועד הבחירות – 30 ביוני 1981.
יושב ראש הוועדה – השופט משה עציוני.
רשימת המועמדים לכנסת העשירית – חוברת 2721 עמ' 2048, מיום 21.6.81.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת העשירית – חוברת 2727 עמ' 2190, מיום 10.7.81.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת ה-11
 
מועד הבחירות – 23 ביולי 1984.
יושב ראש הוועדה – השופט גבריאל בך.
רשימת המועמדים לכנסת ה-11 – חוברת 3073 עמ' 2826, מיום 9.7.84.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-11 – חוברת 3081 עמ' 3006, מיום 1.8.84.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
הבחירות לכנסת ה-12
 
מועד הבחירות – 1 בנובמבר 1988.
יושב ראש הוועדה – השופט אליעזר גולדברג.
רשימת המועמדים לכנסת ה-12 – חוברת 3588 עמ' 146, מיום 23.10.88.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-12 – חוברת 3591 עמ' 242, מיום 9.11.88.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת -13
 
מועד הבחירות – 23 ביוני 1992.
יושב ראש הוועדה – השופט אברהם חלימה.
רשימת המועמדים לכנסת ה-13 – חוברת 4017 עמ' 3620, מיום 14.6.92.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-13 – חוברת 4021 עמ' 3776, מיום 1.7.92.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת ה-14
 
מועד הבחירות – 29 במאי 1996.
יושב ראש הוועדה – השופט תאודור אור.
רשימת המועמדים לכנסת ה-14 – חוברת 4408 עמ' 3286, מיום 9.5.96.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-14 – חוברת 4414 עמ' 3482, מיום 5.6.96.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת ה-15
 
מועד הבחירות – 17 במאי 1999.
יושב ראש הוועדה – השופט אליהו מצא.
רשימת המועמדים לכנסת ה-15 – חוברת 4748 עמ' 3036, מיום 9.5.99.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-15 – חוברת 4757 עמ' 3376, מיום 25.5.99.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות המיוחדות לראשות הממשלה
 
מועד הבחירות – 6 בפברואר 2001 (י"ג בשבט תשס"א).
יושב ראש הוועדה – השופט מישאל חשין.
שמות המועמדים לראשות הממשלה – חוברת 4948 עמ' 1054, מיום 7.1.01.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות המיוחדות – חוברת 4960 עמ' 1628, מיום 12.2.01.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת ה-16
 
מועד הבחירות – 28 בינואר 2003 (כ"ה בשבט תשס"ג).
יושב ראש הוועדה – השופט מישאל חשין.
רשימת המועמדים לכנסת ה-16 - חוברת 5148 עמ' 1192, מיום 19.1.03.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-16 – חוברת 5155 עמ' 1406, מיום 5.2.03.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 

הבחירות לכנסת ה-17
 
מועד הבחירות – 28 במרץ 2006 (כ"ח באדר תשס"ו).
יושבת ראש הוועדה – השופטת דורית ביניש.
רשימת המועמדים לכנסת ה-17 – חוברת 5504 עמ'  2184, מיום 12.3.06.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-17 – חוברת 5514 עמ' 2464, מיום 5.4.06.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת ה-18
 
מועד הבחירות – 10 בפברואר 2009 (ט"ז בשבט תשס"ט).
יושב- ראש הוועדה – השופט אליעזר ריבלין.
רשימת המועמדים לכנסת ה-18 – חוברת 5909 עמ' 2106, מיום 29.1.09.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-18 – חוברת 5917 עמ' 240, מיום 17.2.09.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 
 
הבחירות לכנסת ה-19
 
מועד הבחירות – 22 בינואר 2013 (י"א בשבט תשע"ג).
יושב ראש הוועדה – השופט אליקים רובינשטיין.
רשימת המועמדים לכנסת ה-19 – חוברת 6524, עמ'  1976 מיום 2.1.13.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-19 – חוברת 6540, עמ'  2492 מיום 30.1.13. ת"ט חוברת 6546, עמ' 2874 מיום 12.2.13.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 
 

 
הבחירות לכנסת ה-20

 
מועד הבחירות – 17 במרץ 2015 (כ"ו באדר תשע"ה).
יושב ראש הוועדה – השופט סלים ג'ובראן.
רשימת המועמדים לכנסת ה-20 – חוברת 7000, עמ' 3938 מיום 4.3.2015.קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-20 – חוברת 7010 עמ' 4370 מיום 25.3.2015.​קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
 

 

הבחירות לכנסת ה-21


מועד הבחירות – 9 באפריל 2019 (ד' בניסן התשע"ט).
יושב ראש הוועדה – השופט חנן מלצר.
רשימת המועמדים לכנסת ה-21 – חוברת 8168, עמ' 9022 מיום 25.3.2019.
קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFתוצאות הבחירות לכנסת ה-21 – חוברת 8208, עמ' 10062 מיום 17.04.2019.​​קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF



הבחירות לכנסת ה-22


מועד הבחירות – 17 בספטמבר 2019 (י"ז באלול התשע"ט).
יושב ראש הוועדה – השופט חנן מלצר.​
רשימת המועמדים לכנסת ה-22 – ילקוט הפרסומים, חוברת 8420, עמ' 14,466 מיום 02.09.2019​​קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-22 - חוברת 8454, עמ' 15078 מיום 25.09.2019​קישור לקובץ PDFקישור לקובץ PDF



הבחירות לכנסת ה-23


מועד הבחירות – 2 במרס 2020 (ו' באדר התש"ף).
יושב ראש הוועדה – השופט ניל הנדל.​
רשימת המועמדים לכנסת ה-23 - ילקוט הפרסומים, חוברת 8698, עמ' 3912 מיום 17.02.2020​קישור לקובץ PDFקישור לקובץ PDF
קישור לקובץ PDFקישור לקובץ PDFקישור לקובץ PDF
תוצאות הבחירות לכנסת ה-23 - חוברת 8736, עמ' 4896 מיום 10.03.2020​קישור לקובץ PDF



הבחירות לכנסת ה-24


מועד הבחירות – 23 במרס 2021 (י' בניסן התשפ"א).
יושב ראש הוועדה – השופט עוזי פוגלמן.​​
רשימת המועמדים לכנסת ה-24 - ילקוט הפרסומים, חוברת 9476, עמ' 4248 מיום 14 במרס 2021קישור לקובץ PDF
תוצאות הבחירות לכנסת ה-24 - חוברת 9511, עמ' 4620 מיום 31.03.2021​קישור לקובץ PDF
'''
        pattern = 'הבחירות[ –  –  – ]*([0-9]+) ב([אבגדהוזחטיכלמנסעפצקרשתץןםף]+) ([0-9]{4})'
        m = re.findall(pattern, s)
        l = list()

        for idx, t in enumerate(m):
            day = int(t[0])
            month = self.month_heb_to_eng(t[1])
            year = int(t[2])
            print(f"[{idx+1:>2}]\t{month:^10} \t{year}")
            d = datetime(year=year, month=month, day=day)
            l += [d]
        return l


if __name__ == '__main__':
    election_scrapper = ElectionScrapper()
    election_scrapper.scrape_dates()
